using System;
using System.Collections.Generic;
namespace InSnergyAPI
{
	public class IParam
	{
		public const int TIMEOUT_CHANGE_COLOR = 1000;
		public static Dictionary<string, string> param_desc = new Dictionary<string, string>
		{

			{
				"1",
				"● 直流：電壓● 單相二線：電壓● 單相三線：平均電壓● 三相三線：平均相電壓● 三相四線：平均相電壓V"
			},

			{
				"2",
				" ● 直流：電流● 單相二線：電流● 單相三線：等效電流（總電流）● 三相三線：等效電流（總電流）● 三相四線：等效電流（總電流）A"
			},

			{
				"3",
				" ●頻率Hz"
			},

			{
				"4",
				" ●功率因數"
			},

			{
				"5",
				" ● 直流：功率● 交流：實功率、有效功率W"
			},

			{
				"6",
				" ●視在功率VA"
			},

			{
				"7",
				" ●虛功率、無效功率VAR"
			},

			{
				"8",
				" ● 直流：累計電量● 交流：累計電量KWh"
			},

			{
				"9",
				" ●反向累計電量（相對 8 的累計電能） -KWh"
			},

			{
				"10",
				" ●累計視在電量KVAh"
			},

			{
				"11",
				" ●反向累計視在電量（相對 10 的累計視在電量） -KVAh"
			},

			{
				"12",
				" ●累計虛功電量KVARh"
			},

			{
				"13",
				" ●反向累計虛功電量（相對 12 的累計虛功電量） -KVARh"
			},

			{
				"53",
				" ● 三相三線：平均線電壓● 三相四線：平均線電壓V"
			},

			{
				"54",
				" ● 單相三線：平均電流● 三相三線：平均電流● 三相四線：平均電流A"
			},

			{
				"55",
				" ● 需量預測值KW"
			},

			{
				"1001",
				" ● 單相三線：第一迴路之電壓● 三相三線：A相（R相）相電壓● 三相四線：A相（R相）相電壓V"
			},

			{
				"1002",
				" ● 單相三線：第一迴路之電流● 三相三線：A相（R相）電流● 三相四線：A相（R相）電流A"
			},

			{
				"1003",
				" ● 單相三線：第一迴路之頻率● 三相三線：A相（R相）頻率● 三相四線：A相（R相）頻率Hz"
			},

			{
				"1004",
				" ● 單相三線：第一迴路之功率因數● 三相三線：A相（R相）功率因數● 三相四線：A相（R相）功率因數"
			},

			{
				"1005",
				" ● 單相三線：第一迴路之實功率● 三相三線：A相（R相）實功率● 三相四線：A相（R相）實功率W"
			},

			{
				"1006",
				" ● 單相三線：第一迴路之視在功率● 三相三線：A相（R相）視在功率● 三相四線：A相（R相）視在功率VA"
			},

			{
				"1007",
				" ● 單相三線：第一迴路之虛功率● 三相三線：A相（R相）虛功率● 三相四線：A相（R相）虛功率VAR"
			},

			{
				"1008",
				" ● 單相三線：第一迴路之累計電量● 三相三線：A相（R相）累計電量● 三相四線：A相（R相）累計電量KWh"
			},

			{
				"1009",
				" ● 單相三線：第一迴路之反向累計電量● 三相三線：A相（R相）反向累計電量● 三相四線：A相（R相）反向累計電量-KWh"
			},

			{
				"1010",
				" ● 單相三線：第一迴路之累計視在電量● 三相三線：A相（R相）累計視在電量● 三相四線：A相（R相）累計視在電量KVAh"
			},

			{
				"1011",
				" ● 單相三線：第一迴路之反向累計視在電量● 三相三線：A相（R相）反向累計視在電量● 三相四線：A相（R相）反向累計視在電量-KVAh"
			},

			{
				"1012",
				" ● 單相三線：第一迴路之累計虛功電量● 三相三線：A相（R相）累計虛功電量● 三相四線：A相（R相）累計虛功電量KVARh"
			},

			{
				"1013",
				" ● 單相三線：第一迴路之反向累計虛功電量● 三相三線：A相（R相）反向累計虛功電量● 三相四線：A相（R相）反向累計虛功電量-KVARh"
			},

			{
				"1014",
				" ● 三相：A相（R相）到B相（S相）線電壓 Vab V"
			},

			{
				"2001",
				" ● 單相三線：第二迴路之電壓● 三相三線：B相（S相）相電壓● 三相四線：B相（S相）相電壓V"
			},

			{
				"2002",
				" ● 單相三線：第二迴路之電流● 三相三線：B相（S相）電流● 三相四線：B相（S相）電流A"
			},

			{
				"2003",
				" ● 單相三線：第二迴路之頻率● 三相三線：B相（S相）頻率● 三相四線：B相（S相）頻率Hz"
			},

			{
				"2004",
				" ● 單相三線：第一迴路之功率因數● 三相三線：B相（S相）功率因數● 三相四線：B相（S相）功率因數"
			},

			{
				"2005",
				" ● 單相三線：第二迴路之實功率● 三相三線：B相（S相）實功率● 三相四線：B相（S相）實功率W"
			},

			{
				"2006",
				" ● 單相三線：第二迴路之視在功率● 三相三線：B相（S相）視在功率● 三相四線：B相（S相）視在功率VA"
			},

			{
				"2007",
				" ● 單相三線：第二迴路之虛功率● 三相三線：B相（S相）虛功率● 三相四線：B相（S相）虛功率VAR"
			},

			{
				"2008",
				" ● 單相三線：第二迴路之累計電量● 三相三線：B相（S相）累計電量● 三相四線：B相（S相）累計電量KWh"
			},

			{
				"2009",
				" ● 單相三線：第二迴路之反向累計電量● 三相三線：B相（S相）反向累計電量● 三相四線：B相（S相）反向累計電量-KWh"
			},

			{
				"2010",
				" ● 單相三線：第二迴路之累計視在電量● 三相三線：B相（S相）累計視在電量● 三相四線：B相（S相）累計視在電量KVAh"
			},

			{
				"2011",
				" ● 單相三線：第二迴路之反向累計視在電量● 三相三線：B相（S相）反向累計視在電量● 三相四線：B相（S相）反向累計視在電量-KVAh"
			},

			{
				"2012",
				" ● 單相三線：第二迴路之累計虛功電量● 三相三線：B相（S相）累計虛功電量● 三相四線：B相（S相）累計虛功電量KVARh"
			},

			{
				"2013",
				" ● 單相三線：第二迴路之反向累計虛功電量● 三相三線：B相（S相）反向累計虛功電量● 三相四線：B相（S相）反向累計虛功電量-KVARh"
			},

			{
				"2014",
				" ● 三相：B相（S相）到C相（T相）線電壓 Vbc V"
			},

			{
				"3001",
				" ● 三相三線：C相（T相）相電壓● 三相四線：C相（T相）相電壓V"
			},

			{
				"3002",
				" ● 三相三線：C相（T相）電流● 三相四線：C相（T相）電流A"
			},

			{
				"3003",
				" ● 三相三線：C相（T相）頻率● 三相四線：C相（T相）頻率Hz"
			},

			{
				"3004",
				" ● 三相三線：C相（T相）功率因數● 三相四線：C相（T相）功率因數"
			},

			{
				"3005",
				" ● 三相三線：C相（T相）實功率● 三相四線：C相（T相）實功率W"
			},

			{
				"3006",
				" ● 三相三線：C相（T相）視在功率● 三相四線：C相（T相）視在功率VA"
			},

			{
				"3007",
				" ● 三相三線：C相（T相）虛功率● 三相四線：C相（T相）虛功率VAR"
			},

			{
				"3008",
				" ● 三相三線：C相（T相）累計電量● 三相四線：C相（T相）累計電量KWh"
			},

			{
				"3009",
				" ● 三相三線：C相（T相）反向累計電量● 三相四線：C相（T相）反向累計電量-KWh"
			},

			{
				"3010",
				" ● 三相三線：C相（T相）累計視在電量● 三相四線：C相（T相）累計視在電量KVAh"
			},

			{
				"3011",
				" ● 三相三線：C相（T相）反向累計視在電量● 三相四線：C相（T相）反向累計視在電量-KVAh"
			},

			{
				"3012",
				" ● 三相三線：C相（T相）累計虛功電量● 三相四線：C相（T相）累計虛功電量KVARh"
			},

			{
				"3013",
				" ● 三相三線：C相（T相）反向累計虛功電量● 三相四線：C相（T相）反向累計虛功電量-KVARh"
			},

			{
				"3014",
				" ● 三相：C相（T相）到A相（R相）線電壓 Vca V"
			}
		};
		public int aID;
		public double dvalue;
		public DateTime lastChanged;
		public DateTime time;
		public IParam DeepClone()
		{
			return new IParam(this);
		}
		public IParam(IParam pa)
		{
			this.aID = pa.aID;
			this.dvalue = pa.dvalue;
			this.time = pa.time;
			this.lastChanged = pa.lastChanged;
		}
		public IParam(int aid, double d, DateTime t)
		{
			this.aID = aid;
			this.dvalue = d;
			this.time = t;
			this.lastChanged = DateTime.Now;
		}
		public void Update(double v1, DateTime t)
		{
			if (v1 != this.dvalue)
			{
				this.lastChanged = DateTime.Now;
			}
			this.dvalue = v1;
			this.time = t;
		}
		public void Update(IParam param)
		{
			if (this.aID != param.aID)
			{
				return;
			}
			this.Update(param.dvalue, param.time);
		}
		public bool IsHighlight()
		{
			if (!(this.lastChanged != DateTime.MinValue))
			{
				this.lastChanged = DateTime.MinValue;
				return false;
			}
			if ((DateTime.Now - this.lastChanged).TotalMilliseconds > 1000.0)
			{
				this.lastChanged = DateTime.MinValue;
				return false;
			}
			return true;
		}
	}
}
